#include <stdio.h>
#include <time.h>
#include <math.h>

void fun1();
void fun2();
void fun3();
void fun4();
void leapYear();
void maxDayOfMonth();
void weekday();
void festival();
int dayOfYear(int, int, int);
int printTable(int, int);

struct festival
{
    int year;
    int month;
    int day;
    char festivalName[20];
};

struct festival festivals[330] = {
        {2000, 2, 5, "春节"},
        {2001, 1, 24, "春节"},
        {2002, 2, 12, "春节"},
        {2003, 1, 31, "春节"},
        {2004, 1, 22, "春节"},
        {2005, 2, 9, "春节"},
        {2006, 1, 29, "春节"},
        {2007, 2, 18, "春节"},
        {2008, 2, 7, "春节"},
        {2009, 1, 26, "春节"},
        {2010, 2, 14, "春节"},
        {2011, 2, 3, "春节"},
        {2012, 1, 23, "春节"},
        {2013, 2, 10, "春节"},
        {2014, 1, 31, "春节"},
        {2015, 2, 19, "春节"},
        {2016, 2, 8, "春节"},
        {2017, 1, 28, "春节"},
        {2018, 2, 16, "春节"},
        {2019, 2, 5, "春节"},
        {2020, 1, 25, "春节"},
        {2021, 2, 12, "春节"},
        {2022, 2, 1, "春节"},
        {2023, 1, 22, "春节"},
        {2024, 2, 10, "春节"},
        {2025, 1, 29, "春节"},
        {2026, 2, 17, "春节"},
        {2027, 2, 6, "春节"},
        {2028, 1, 26, "春节"},
        {2029, 2, 13, "春节"},
        {2030, 2, 3, "春节"},
        {2000, 2, 19, "元宵节"},
        {2001, 2, 7, "元宵节"},
        {2002, 2, 26, "元宵节"},
        {2003, 2, 15, "元宵节"},
        {2004, 2, 5, "元宵节"},
        {2005, 2, 23, "元宵节"},
        {2006, 2, 12, "元宵节"},
        {2007, 3, 4, "元宵节"},
        {2008, 2, 21, "元宵节"},
        {2009, 2, 9, "元宵节"},
        {2010, 2, 28, "元宵节"},
        {2011, 2, 17, "元宵节"},
        {2012, 2, 6, "元宵节"},
        {2013, 2, 24, "元宵节"},
        {2014, 2, 14, "元宵节"},
        {2015, 3, 5, "元宵节"},
        {2016, 2, 22, "元宵节"},
        {2017, 2, 11, "元宵节"},
        {2018, 3, 2, "元宵节"},
        {2019, 2, 19, "元宵节"},
        {2020, 2, 8, "元宵节"},
        {2021, 2, 26, "元宵节"},
        {2022, 2, 15, "元宵节"},
        {2023, 2, 5, "元宵节"},
        {2024, 2, 24, "元宵节"},
        {2025, 2, 12, "元宵节"},
        {2026, 3, 3, "元宵节"},
        {2027, 2, 20, "元宵节"},
        {2028, 2, 9, "元宵节"},
        {2029, 2, 27, "元宵节"},
        {2030, 2, 17, "元宵节"},
        {2000, 3, 7, "龙抬头"},
        {2001, 2, 24, "龙抬头"},
        {2002, 3, 15, "龙抬头"},
        {2003, 3, 4, "龙抬头"},
        {2004, 2, 21, "龙抬头"},
        {2005, 3, 11, "龙抬头"},
        {2006, 3, 1, "龙抬头"},
        {2007, 3, 20, "龙抬头"},
        {2008, 3, 9, "龙抬头"},
        {2009, 2, 26, "龙抬头"},
        {2010, 3, 17, "龙抬头"},
        {2011, 3, 6, "龙抬头"},
        {2012, 2, 23, "龙抬头"},
        {2013, 3, 13, "龙抬头"},
        {2014, 3, 2, "龙抬头"},
        {2015, 3, 21, "龙抬头"},
        {2016, 3, 10, "龙抬头"},
        {2017, 2, 27, "龙抬头"},
        {2018, 3, 18, "龙抬头"},
        {2019, 3, 8, "龙抬头"},
        {2020, 2, 24, "龙抬头"},
        {2021, 3, 14, "龙抬头"},
        {2022, 3, 4, "龙抬头"},
        {2023, 2, 21, "龙抬头"},
        {2024, 3, 11, "龙抬头"},
        {2025, 3, 1, "龙抬头"},
        {2026, 3, 20, "龙抬头"},
        {2027, 3, 9, "龙抬头"},
        {2028, 2, 26, "龙抬头"},
        {2029, 3, 16, "龙抬头"},
        {2030, 3, 5, "龙抬头"},
        {2000, 6, 6, "端午节"},
        {2001, 6, 25, "端午节"},
        {2002, 6, 15, "端午节"},
        {2003, 6, 4, "端午节"},
        {2004, 6, 22, "端午节"},
        {2005, 6, 11, "端午节"},
        {2006, 5, 31, "端午节"},
        {2007, 6, 19, "端午节"},
        {2008, 6, 8, "端午节"},
        {2009, 5, 28, "端午节"},
        {2010, 6, 16, "端午节"},
        {2011, 6, 6, "端午节"},
        {2012, 6, 23, "端午节"},
        {2013, 6, 12, "端午节"},
        {2014, 6, 2, "端午节"},
        {2015, 6, 20, "端午节"},
        {2016, 6, 9, "端午节"},
        {2017, 5, 30, "端午节"},
        {2018, 6, 18, "端午节"},
        {2019, 6, 7, "端午节"},
        {2020, 6, 25, "端午节"},
        {2021, 6, 14, "端午节"},
        {2022, 6, 3, "端午节"},
        {2023, 6, 22, "端午节"},
        {2024, 6, 10, "端午节"},
        {2025, 5, 31, "端午节"},
        {2026, 6, 19, "端午节"},
        {2027, 6, 9, "端午节"},
        {2028, 5, 28, "端午节"},
        {2029, 6, 16, "端午节"},
        {2030, 6, 5, "端午节"},
        {2000, 8, 6, "七夕节"},
        {2001, 8, 25, "七夕节"},
        {2002, 8, 15, "七夕节"},
        {2003, 8, 4, "七夕节"},
        {2004, 8, 22, "七夕节"},
        {2005, 8, 11, "七夕节"},
        {2006, 7, 31, "七夕节"},
        {2007, 8, 19, "七夕节"},
        {2008, 8, 7, "七夕节"},
        {2009, 8, 26, "七夕节"},
        {2010, 8, 16, "七夕节"},
        {2011, 8, 6, "七夕节"},
        {2012, 8, 23, "七夕节"},
        {2013, 8, 13, "七夕节"},
        {2014, 8, 2, "七夕节"},
        {2015, 8, 20, "七夕节"},
        {2016, 8, 9, "七夕节"},
        {2017, 8, 28, "七夕节"},
        {2018, 8, 17, "七夕节"},
        {2019, 8, 7, "七夕节"},
        {2020, 8, 25, "七夕节"},
        {2021, 8, 14, "七夕节"},
        {2022, 8, 4, "七夕节"},
        {2023, 8, 22, "七夕节"},
        {2024, 8, 10, "七夕节"},
        {2025, 8, 29, "七夕节"},
        {2026, 8, 19, "七夕节"},
        {2027, 8, 8, "七夕节"},
        {2028, 8, 26, "七夕节"},
        {2029, 8, 16, "七夕节"},
        {2030, 8, 5, "七夕节"},
        {2000, 8, 14, "中元节"},
        {2001, 9, 2, "中元节"},
        {2002, 8, 23, "中元节"},
        {2003, 8, 12, "中元节"},
        {2004, 8, 30, "中元节"},
        {2005, 8, 19, "中元节"},
        {2006, 8, 8, "中元节"},
        {2007, 8, 27, "中元节"},
        {2008, 8, 15, "中元节"},
        {2009, 9, 3, "中元节"},
        {2010, 8, 24, "中元节"},
        {2011, 8, 14, "中元节"},
        {2012, 8, 31, "中元节"},
        {2013, 8, 21, "中元节"},
        {2014, 8, 10, "中元节"},
        {2015, 8, 28, "中元节"},
        {2016, 8, 17, "中元节"},
        {2017, 9, 5, "中元节"},
        {2018, 8, 25, "中元节"},
        {2019, 8, 15, "中元节"},
        {2020, 9, 2, "中元节"},
        {2021, 8, 22, "中元节"},
        {2022, 8, 12, "中元节"},
        {2023, 8, 30, "中元节"},
        {2024, 8, 18, "中元节"},
        {2025, 9, 6, "中元节"},
        {2026, 8, 27, "中元节"},
        {2027, 8, 16, "中元节"},
        {2028, 9, 4, "中元节"},
        {2029, 8, 24, "中元节"},
        {2030, 8, 13, "中元节"},
        {2000, 9, 12, "中秋节"},
        {2001, 10, 1, "中秋节"},
        {2002, 9, 21, "中秋节"},
        {2003, 9, 11, "中秋节"},
        {2004, 9, 28, "中秋节"},
        {2005, 9, 18, "中秋节"},
        {2006, 10, 6, "中秋节"},
        {2007, 9, 25, "中秋节"},
        {2008, 9, 14, "中秋节"},
        {2009, 10, 3, "中秋节"},
        {2010, 9, 22, "中秋节"},
        {2011, 9, 12, "中秋节"},
        {2012, 9, 30, "中秋节"},
        {2013, 9, 19, "中秋节"},
        {2014, 9, 8, "中秋节"},
        {2015, 9, 27, "中秋节"},
        {2016, 9, 15, "中秋节"},
        {2017, 10, 4, "中秋节"},
        {2018, 9, 24, "中秋节"},
        {2019, 9, 13, "中秋节"},
        {2020, 10, 1, "中秋节"},
        {2021, 9, 21, "中秋节"},
        {2022, 9, 10, "中秋节"},
        {2023, 9, 29, "中秋节"},
        {2024, 9, 17, "中秋节"},
        {2025, 10, 6, "中秋节"},
        {2026, 9, 25, "中秋节"},
        {2027, 9, 15, "中秋节"},
        {2028, 10, 3, "中秋节"},
        {2029, 9, 22, "中秋节"},
        {2030, 9, 12, "中秋节"},
        {2000, 10, 6, "重阳节"},
        {2001, 10, 25, "重阳节"},
        {2002, 10, 14, "重阳节"},
        {2003, 10, 4, "重阳节"},
        {2004, 10, 22, "重阳节"},
        {2005, 10, 11, "重阳节"},
        {2006, 10, 30, "重阳节"},
        {2007, 10, 19, "重阳节"},
        {2008, 10, 7, "重阳节"},
        {2009, 10, 26, "重阳节"},
        {2010, 10, 16, "重阳节"},
        {2011, 10, 5, "重阳节"},
        {2012, 10, 23, "重阳节"},
        {2013, 10, 13, "重阳节"},
        {2014, 10, 2, "重阳节"},
        {2015, 10, 21, "重阳节"},
        {2016, 10, 9, "重阳节"},
        {2017, 10, 28, "重阳节"},
        {2018, 10, 17, "重阳节"},
        {2019, 10, 7, "重阳节"},
        {2020, 10, 25, "重阳节"},
        {2021, 10, 14, "重阳节"},
        {2022, 10, 4, "重阳节"},
        {2023, 10, 23, "重阳节"},
        {2024, 10, 11, "重阳节"},
        {2025, 10, 29, "重阳节"},
        {2026, 10, 18, "重阳节"},
        {2027, 10, 8, "重阳节"},
        {2028, 10, 26, "重阳节"},
        {2029, 10, 15, "重阳节"},
        {2030, 10, 5, "重阳节"},
        {2000, 10, 26, "寒衣节"},
        {2001, 11, 15, "寒衣节"},
        {2002, 11, 4, "寒衣节"},
        {2003, 10, 25, "寒衣节"},
        {2004, 11, 12, "寒衣节"},
        {2005, 11, 2, "寒衣节"},
        {2006, 10, 22, "寒衣节"},
        {2007, 11, 10, "寒衣节"},
        {2008, 10, 29, "寒衣节"},
        {2009, 11, 17, "寒衣节"},
        {2010, 11, 6, "寒衣节"},
        {2011, 10, 27, "寒衣节"},
        {2012, 11, 14, "寒衣节"},
        {2013, 11, 3, "寒衣节"},
        {2014, 10, 24, "寒衣节"},
        {2015, 11, 12, "寒衣节"},
        {2016, 10, 31, "寒衣节"},
        {2017, 11, 18, "寒衣节"},
        {2018, 11, 8, "寒衣节"},
        {2019, 10, 28, "寒衣节"},
        {2020, 11, 15, "寒衣节"},
        {2021, 11, 5, "寒衣节"},
        {2022, 10, 25, "寒衣节"},
        {2023, 11, 13, "寒衣节"},
        {2024, 11, 1, "寒衣节"},
        {2025, 11, 20, "寒衣节"},
        {2026, 11, 9, "寒衣节"},
        {2027, 10, 29, "寒衣节"},
        {2028, 11, 16, "寒衣节"},
        {2029, 11, 6, "寒衣节"},
        {2030, 10, 26, "寒衣节"},
        {2000, 1, 7, "腊八节"},
        {2001, 1, 24, "腊八节"},
        {2002, 1, 13, "腊八节"},
        {2003, 1, 2, "腊八节"},
        {2004, 1, 20, "腊八节"},
        {2005, 1, 9, "腊八节"},
        {2006, 1, 28, "腊八节"},
        {2007, 1, 17, "腊八节"},
        {2008, 1, 6, "腊八节"},
        {2009, 1, 24, "腊八节"},
        {2010, 1, 13, "腊八节"},
        {2011, 1, 2, "腊八节"},
        {2012, 1, 20, "腊八节"},
        {2013, 1, 8, "腊八节"},
        {2014, 1, 27, "腊八节"},
        {2015, 1, 16, "腊八节"},
        {2016, 1, 5, "腊八节"},
        {2017, 1, 23, "腊八节"},
        {2018, 1, 12, "腊八节"},
        {2019, 1, 1, "腊八节"},
        {2019, 12, 31, "腊八节"},
        {2020, 1, 19, "腊八节"},
        {2021, 1, 7, "腊八节"},
        {2022, 1, 26, "腊八节"},
        {2023, 1, 14, "腊八节"},
        {2024, 1, 3, "腊八节"},
        {2025, 1, 21, "腊八节"},
        {2026, 1, 10, "腊八节"},
        {2027, 1, 29, "腊八节"},
        {2028, 1, 17, "腊八节"},
        {2029, 1, 5, "腊八节"},
        {2030, 1, 24, "腊八节"}
    };

int main()
{
    while (1)
    {
        int n;
        printf("请输入查询内容\n");
        printf("1.显示年历\n");
        printf("2.显示月历\n");
        printf("3.日历统计\n");
        printf("4.查询年历\n");
        printf("5.退出\n");
        if (n == 5)
            break;
        scanf("%d", &n);
        switch (n)
        {
            case 1:
                fun1();
                break;
            case 2:
                fun2();
                break;;
            case 3:
                fun3();
                break;
            case 4:
                fun4();
                break;
            default:
                printf("输入错误，请重新输入\n\n\n");
        }
    }
    return 0;
}

void fun1()
{
    int year, month;
    printf("请输入年份\n");
    scanf("%d", &year);
    char a[13][7] = {"一", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "十二"};
    for (month = 1; month <= 12; month++)
    {
        printf("%s月\n", a[month - 1]);
        printTable(year, month);
        printf("\n\n");
    }
}

void fun2()
{
    int year, month;
    printf("请输入年份和月份，以/隔开\n");
    scanf("%d/%d", &year, &month);
    printTable(year, month);
    printf("\n\n");
}

void fun3()
{
    int year, month, day, numOfDay;
    printf("请输入年月日，中间以/隔开\n");
    scanf("%d/%d/%d", &year, &month, &day);

    numOfDay = dayOfYear(year, month, day);
    printf("这一天是该年的第%d天\n", numOfDay);

    time_t timep;
    struct tm *tm;
    time(&timep);
    tm = localtime(&timep);
    int date_i = tm->tm_mday;
    int month_i = tm->tm_mon + 1;
    int year_i = tm->tm_year + 1900;
    int numOfDay_today = dayOfYear(year_i, month_i, date_i);
    int dayBetween = 0;
    if (year_i > year)
    {
        int temp0 = year_i;
        year_i = year;
        year = temp0;
        int temp1 = month_i;
        month_i = month;
        month = temp1;
        int temp2 = date_i;
        date_i = day;
        day = temp2;
    }

    if (year_i % 4 == 0 && year_i % 100 != 0 || year_i % 400 == 0)
        dayBetween += 366 - dayOfYear(year_i, month_i, date_i);
    else
        dayBetween += 365 - dayOfYear(year_i, month_i, date_i);

    for (int i = year_i + 1; i < year; i++)
    {
        if (i % 4 == 0 && i % 100 != 0 || i % 400 == 0)
            dayBetween += 366;
        else
            dayBetween += 365;
    }

    dayBetween += dayOfYear(year, month, day);
    printf("这一天距离今天%d天\n\n\n", dayBetween);
}

void fun4()
{
    int n;
    printf("1.查询是否是闰年\n");
    printf("2.查询某月的最大天数\n");
    printf("3.查询某年某月某日是星期几\n");
    printf("4.查询某年某月某日是否是阴历或公历节日\n");
    printf("5.返回\n");
    scanf("%d", &n);
    switch (n)
    {
        case 1:
            leapYear();
            break;
        case 2:
            maxDayOfMonth();
            break;
        case 3:
            weekday();
            break;
        case 4:
            festival();
            break;
        case 5:
            return;
        default:
            printf("输入错误，请重新输入\n\n\n");
    }
}

void leapYear()
{
    int year;
    printf("请输入需要查询的年份\n");
    scanf("%d", &year);
    if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0)
        printf("该年份是闰年\n\n\n");
    else
        printf("该年份不是闰年\n\n\n");
}

void maxDayOfMonth()
{
    int month, maxDay;
    printf("请输入需要查询的月份\n");
    scanf("%d", &month);
    if (month == 1 || month == 3 || month == 5 || month == 7 || month == 8 || month == 10 || month == 12)
        maxDay = 31;
    else if (month == 4 || month == 6 || month == 9 || month == 11)
        maxDay = 30;
    else if (month == 2)
        maxDay = 29;
    else
        printf("输入错误，请重新输入\n\n\n");
    printf("该月最大天数为%d\n\n\n", maxDay);
}

void weekday()
{
    int year, month, day, weekday, q, m, j, k;
    printf("请输入年月日，中间以/隔开\n");
    scanf("%d/%d/%d", &year, &month, &day);

    q = day;
    if (month == 1 || month == 2)
    {
        m = month + 12;
        year--;
    } else
        m = month;
    j = year / 100;
    k = year % 100;
    weekday = (q + (26 * (m + 1) / 10) + k + k / 4 + 5 * j + j / 4) % 7 - 2;
    if (weekday < 0)
        weekday += 7;

    switch (weekday)
    {
        case 0:
            printf("这一天是星期一\n");
            break;
        case 1:
            printf("这一天是星期二\n");
            break;
        case 2:
            printf("这一天是星期三\n");
            break;
        case 3:
            printf("这一天是星期四\n");
            break;
        case 4:
            printf("这一天是星期五\n");
            break;
        case 5:
            printf("这一天是星期六\n");
            break;
        case 6:
            printf("这一天是星期日\n");
            break;
    }
    printf("\n\n");
}

void festival()
{
    int year, month, day;
    printf("请输入年月日，中间以/隔开\n");
    scanf("%d/%d/%d", &year, &month, &day);
    if (month == 1 && day == 1)
        printf("这一天为元旦节\n");
    else if (month == 2 && day == 14)
        printf("这一天为情人节\n");
    else if (month == 3 && day == 8)
        printf("这一天为妇女节\n");
    else if (month == 3 && day == 12)
        printf("这一天为植树节\n");
    else if (month == 4 && day == 1)
        printf("这一天为愚人节\n");
    else if (month == 5 && day == 1)
        printf("这一天为劳动节\n");
    else if (month == 6 && day == 1)
        printf("这一天为儿童节\n");
    else if (month == 7 && day == 1)
        printf("这一天为建党节\n");
    else if (month == 8 && day == 1)
        printf("这一天为建军节\n");
    else if (month == 9 && day == 10)
        printf("这一天为教师节\n");
    else if (month == 10 && day == 1)
        printf("这一天为国庆节\n");
    else
        printf("这一天不是公历节日\n");


    int check = 0;
    for (int i = 0; i < 330; i++)
    {
        if (year == festivals[i].year && month == festivals[i].month && day == festivals[i].day)
        {
            printf("这一天是%s\n", festivals[i].festivalName);
            check = 1;
        }
    }
    if (check == 0)
        printf("这一天不是农历节日\n");
}

int dayOfYear(int year, int month, int day)
{
    int numOfDay = 0, i;
    for (i = 1; i < month; i++)
    {
        if (i == 1 || i == 3 || i == 5 || i == 7 || i == 8 || i == 10 || i == 12)
            numOfDay += 31;
        else if (i == 4 || i == 6 || i == 9 || i == 11)
            numOfDay += 30;
        else
        {
            if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0)
                numOfDay += 29;
            else
                numOfDay += 28;
        }
    }
    numOfDay += day;
    return numOfDay;
}

int printTable(int year, int month)
{
    int weekday, i, count = 0, dateNum, q, m, j, k;

    if (month == 1 || month == 3 || month == 5 || month == 7 || month == 8 || month == 10 || month == 12)
        dateNum = 31;
    else if (month == 4 || month == 6 || month == 9 || month == 11)
        dateNum = 30;
    else
    {
        if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0)
            dateNum = 29;
        else
            dateNum = 28;
    }

    q = 1;
    if (month == 1 || month == 2)
    {
        m = month + 12;
        year--;
    } else
        m = month;
    j = year / 100;
    k = year % 100;
    weekday = (q + (26 * (m + 1) / 10) + k + k / 4 + 5 * j + j / 4) % 7 - 1;
    if (weekday < 0)
        weekday += 7;

    printf("日\t一\t二\t三\t四\t五\t六\t\n");

    if (weekday != 7)
    {
        for (i = 0; i < weekday; i++)
        {
            printf("\t");
            count++;
        }
    }
    for (i = 1; i <= dateNum; i++)
    {
        printf("%d\t", i);
        count++;
        if (count % 7 == 0)
            printf("\n");
    }
}
